import "./App.css";

import Navbar from "./Components/Navbar/Navbar";
import MemberCard from "./Components/MemberCard/MemberCard";
import ActiveCard from "./Components/ActiveCard/ActiveCard";
import WorkSection from "./Components/WorkSection/WorkSection";
import jsonData from "./Assets/exec.json";
import dataMember from "./Assets/member.json";
import Image from "./Assets/work-1.png";
import Banner from "./Assets/banner.jpg";
import w11 from "./Assets/1-1.png";
import w12 from "./Assets/1-2.png";
import w13 from "./Assets/1-3.png";
import w21 from "./Assets/2-1.png";
import w22 from "./Assets/2-2.png";
import w31 from "./Assets/3-1.png";
import w32 from "./Assets/3-2.png";
import w41 from "./Assets/4-1.png";
import w42 from "./Assets/4-2.png";
import w51 from "./Assets/5-1.png";
import w52 from "./Assets/5-2.png";
import w61 from "./Assets/6-1.png";
import w62 from "./Assets/6-2.png";
import w71 from "./Assets/7-1.png";
import w72 from "./Assets/7-2.png";
import w91 from "./Assets/9-1.png";
import w92 from "./Assets/9-2.png";
import w121 from "./Assets/12-1.png";
import w122 from "./Assets/12-2.png";
import w131 from "./Assets/13-1.png";
import w132 from "./Assets/13-2.png";
import w141 from "./Assets/14-1.png";
import w142 from "./Assets/14-2.png";
import w161 from "./Assets/16-1.png";
import w162 from "./Assets/16-2.png";
import w171 from "./Assets/17-1.png";
import w172 from "./Assets/17-2.png";
import w191 from "./Assets/19-1.png";
import w192 from "./Assets/19-2.png";
import w201 from "./Assets/20-1.png";
import w202 from "./Assets/20-2.png";
import w211 from "./Assets/21-1.png";
import w212 from "./Assets/21-2.png";
import w221 from "./Assets/22-1.png";
import w222 from "./Assets/22-2.png";

function Home() {
  return (
    <div className="App">
      <Navbar />
      <div className="banner">
        <img className="banner-image" src={Banner} />
      </div>

      <h1 className="ourAim">अनुभव गहलोत मैमोरियल ट्रस्ट के मंच से</h1>
      <div className="Aim">
        <p className="para1">
          अनुभव गहलोत मेमोरियल ट्रस्ट के सफलतापूवर्क प्रथम वर्ष सम्पूर्ण करने पर
          मैं (दयानन्द सिंह गहलोत) प्रेसीडेन्ट, ट्रस्ट के विगत! एवं सभी
          कार्यक्रमों पर प्रकाश डालना चाहता हूँ। इस ट्रस्ट का उद्देश्य अनुभव
          गहलोत (मेरे छोटे बेटे) के विचारों के अनुरूप सभी अध्यापकों,
          छात्र-छात्राओं एवं उनके माता-पिता के प्रोत्साहन एवं मार्गदर्शन करना
          है।
        </p>
      </div>

      <h1 className="work">ट्रस्ट के विषय में</h1>
      <div className="workdone">
        <div className="work-left">
          <p className="para">
            अनुभव गहलोत मेमोरियल ट्रस्ट की स्थापना अनुभव गहलोत की स्मृति मंे
            दिनांक 9 जनवरी 2015 को की गई जिसकी पंजीकरण संख्या 24 है। मेरा पुत्र
            20 अप्रैल, 2013 को 20 वर्ष की अल्पायु में ही हमसे बिछुड़ गया। इस
            ट्रस्ट की स्थापना समाज सेवा के माध्यम से गरीबों एवं जरूरतमंदों की
            मदद करने के लिए की गई है। इसके अतिरिक्त मेधावी छात्र-छात्राओं एवं
            आदर्श अध्यापकों को पारितोषिक द्वारा प्रोत्साहित करना भी एक लक्ष्य
            है। ट्रस्ट में उन सभी लोगों का स्वागत है जो निष्काम भाव से कार्यशील
            सदस्य बनकर समाज की सेवा करना चाहते हैं। मैं प्रत्येक छात्र में अपने
            पुत्र अनुभव की छवि देखना चाहता हूँ और प्रत्येक छात्र को अनुभव गहलोत
            के समान मेधावी छात्र बनते हुए देखना चाहता हूँ।
          </p>
        </div>
        <div className="work-right">
          <img className="work-image" src={Image} />
        </div>
      </div>
      <h1 className="work">जीवनी: अनुभव गहलोत</h1>
      <div className="jeevani">
        <p className="para">
          अनुभव गहलोत का जन्म 24 अप्रैल, 1993 को हुआ। अपने सम्पूर्ण विद्यालयी
          शिक्षा में स्वर्ण पदक विजेता एवं कला, संगीत एवं खेलकूद में सदैव अग्रणी
          विशेषकर फुटबॉल प्रिय खेल रहा। उनकी स्कूली शिक्षा दिल्ली पब्लिक स्कूल,
          आर. के. पुरम तदुन्परात उच्च शिक्षा प्राप्ति हेतु विदेशों की मान्यता
          प्राप्त विश्वविद्यालय जिसमें सिंगापुर इंस्टीट्यूट ऑफ मैनेजमेंट एवं आर.
          एम. आई. टी. आस्ट्रेलिया उल्लेखनीय हैं जहाँ वह स्कॉलर रहे। उनका
          व्यक्तित्व सौम्य आकर्षक एवं प्रभावशाली था। विश्वास, ईनामदारी, प्रेम,
          सहयोग एवं सदैव प्रसन्नचित्त रहना जैसे गुण उनके व्यक्तित्व की शोभा थे।
          उनके व्यक्तित्व का एक विशिष्ट गुण था कि यदि एक बार किसी भी व्यक्ति को
          वह अपने परिवार का सदस्य मान लेते तो सदैव उसको सहयोग करते एवं उनको
          प्रसन्न रखने हेतु प्रयत्नशील रहते। गुस्सा उनका स्वभाव नहीं था लेकिन
          अन्याय उनसे सहन नहीं होता था। संगीत से उन्हें विशेष प्रेम था और अपने
          शारीरिक स्वास्थ्य को लेकर वह बहुत सजग थे जिसमें उनका अपना ही अंदाज था।
          हालांकि कुदरत के क्रूर हाथों ने एक दुघर्टना में उन्हें हमसे छीन लिया
          है लेकिन फिर भी वह हमारा अगाध प्रेम उनके प्रति कभी शून्य नहीं होगा।
        </p>
      </div>
      <h1>
        अनुभव गहलोत मैमोरियल ट्रस्ट द्वारा किए गए अब तक के कार्यक्रमों पर एक
        दृष्टिः
      </h1>
      <WorkSection
        para="1. प्रथम कार्यक्रम सोनीपत जिले के गाँव रिढाऊ मंे दिनांक 24 अप्रैल,
            2014 को आयोजित किया गया जिसके अंतर्गत प्रत्येक कक्षा के प्रथम,
            द्वितीय एवं तृतीय श्रेणी उत्तीर्ण छात्र-छात्राओं को पारितोषिक एवं
            नगद राशि पुरस्कार स्कॉलरशिप स्वरूप वितरित किए गए। विद्यालय के
            प्राधानाचार्य एवं विशिष्ट अध्यापक को भी सम्मानित किया गया। कार्यक्रम
            की सफलता छात्र-छात्राओं एवं अध्यापकों के उत्साह एवं उनके मुख-मण्डल
            की आभा से सफल बनाने हेतु सभी ग्रामवासियों ने भी अपना भरपूर सहयोग एवं
            योगदान प्रदान किया, जिसके लिए ट्रस्ट उनका आभार व्यक्त करता है।"
        images1={w11}
        images2={w12}
      />
      <WorkSection
        para="2. दूसरा कार्यक्रम दिनांक 27 जुलाई, 2014 को रिढाऊ गाँव में ही फ्री
            मेडिकल हैल्थ कैम्प का आयोजन करके किया गया जिसके अंतर्गत लोगों का
            स्वास्थ्य संबंधी मार्गदर्शन किया गया। इस कार्यक्रम मंे 40 डॉक्टर्स
            की टीम दिल्ली से बुलाई गई और ग्रामवासियों को फ्री मेड़िकल हैल्थ एवं
            चश्मे की सुविधा उपलब्ध करवाई गई। इस हैल्थ कैम्प में लगभग 984 लोगों
            ने शिरकत करके स्वास्थ्य लाभ लिया जिसमें हड्डी रोग विशेषज्ञ, आँखों के
            रोगों के विशेषज्ञ, ह्नदय रोग विशेषज्ञ, बाल रोग विशेषज्ञ एवं स्त्री
            रोग विशेषज्ञ सम्मिलित थे। इस कार्यक्रम के अंतर्गत खून की मुफ्त जाँच
            एवं ईसीजी जाँच की गई तथा मुफ्त चश्में वितरित किए गए।"
        images1={w21}
        images2={w22}
      />
      <WorkSection
        para="3. दिनांक 2 नवम्बर, 2014 को गुड़गाँव के सेक्टर-31 में मुफ्त आँखों की
            जाँच एवं इलाज का कैम्प आयोजित किया गया। जिसे ट्रस्ट के सौजन्य से इस
            आयोजन को सफल बनाने में श्रीमती सुदेश गहलोत का भरपूर योगदान रहा।
            आयोजित इस कैम्प में लगभग 100 लोगों ने अपने नेत्र संबंधी रोगों का
            चैकअप एवं निदान करवाया।"
        images1={w31}
        images2={w32}
      />
      <WorkSection
        para="4. इसके उपरांत दिनांक 6 नवम्बर, 2014 को ट्रस्ट ने रोहतक जिले के गाँव डीगल में
महिलाओं एवं बच्चियों के उत्थान हेतु मुफ्त सिलाई सेंटर की स्थापना की जिसका
शुभारम्भ। नई सिलाई मशीनों द्वारा किया गया। यह सिलाई सेंटर दो शिफ्टांे में
अनुभवी एवं प्रक्षिशित दो अध्यापकों द्वारा सफलतापूर्वक चलाया जा रहा है। प्रत्येक
छः माह के उपरांत प्रक्षिशित महिलाओं एवं बच्चियों को ट्रस्ट द्वारा सार्टि फिकेट
प्रदान किए जाते हैं। इसको सफलता पूर्वक चलाने में ट्रस्ट के माननीय सदस्य श्री
ओ.पी. शर्मा जी का पूर्ण योगदान है।"
        images1={w41}
        images2={w42}
      />
      <WorkSection
        para="5. इसके अतिरिक्त लगभग एक महीने के समय में रिढाऊ गाँव के प्राचीन शिव मन्दिर
का ट्रस्ट द्वारा जीर्णोंद्धार किया गया तथा महाशिवरात्री पर्व पर दिनांक 17 फरवरी,
2015 को मन्दिर प्राँगण में विशाल भण्डारे एवं महायज्ञ का आयोजन किया गया एवं
मन्दिर को सभी श्रद्धालुओं एवं भक्तों के लिए समर्पित कर दिया गया।"
        images1={w51}
        images2={w52}
      />
      <WorkSection
        para="6. दिनांक 26 दिसम्बर 2015 - अनुभव गहलोत मेमोरियल ट्रस्ट के सदस्यों द्वारा
गुड़गाँव के शीतला माता मन्दिर के प्रांगण में भण्डारे का आयोजन किया गया
जिसमें लगभग 1000 लोगों में भण्डारा बांटा गया।"
        images1={w61}
        images2={w62}
      />
      <WorkSection
        para="7. दिनांक 23 अप्रैल 2015 - सरकारी माध्यमिक विद्यालय, रिढाउ, सीनियर सैकेण्डरी
सरकारी कन्या विद्यालय फरमाना, सीनियर सैकेण्डरी सरकारी बाल विद्यालय
फरमाना में वार्षिक स्कॉलरशिप का आयोजन हुआ जिसमें तीसरी कक्षा से बारहवीं
कक्षा के प्रथम, द्वितीय एवं तृतीय श्रेणी के विद्यार्थियों को अनुभव गहलोत
मेमोरियल ट्रस्ट द्वारा सभी पुरस्कृत विद्यार्थियों को सर्टिफिकेट एवं 62 साईकिलें
बांटी गई तथा बेस्ट टीचर अवार्ड एवं बेस्ट सहायक अवार्ड भी दिये गये।"
        images1={w71}
        images2={w72}
      />
      <WorkSection
        para="8. दिनांक 30 अगस्त 2015 - अनुभव गहलोत मेमोरियल ट्रस्ट की तरफ से गांव
मिलकपुर, जिला जिन्द में महिलाओं के लिए निःशुल्क सिलाई केन्द्र की स्थापना
की गई। गाँव मिलकपुर के फ्री सिलाई सेंटर को सफलतापूर्वक चलाने का सम्पूर्ण
श्रेय ट्रस्ट के माननीय सदस्य श्री एस. एस. संधू जी को जाता है। इस केन्द्र में
प्रति छः माह उपरांत सर्टिफिकेट और प्रथम, द्वितीय एवं तृतीय प्रशिक्षित को नगद
इनाम दिया जाता है।"
      />
      <WorkSection
        para="9. दिनांक 17 सितम्बर 2016 - कैप्टन चन्दर लाल स्पेशन मिडिल अन्ध विद्यालय,
गुरूग्रांव मंे विद्यार्थियों को 135 डिब्बेल स्नैक्स के बाटे गये। इसके अतिरिक्त स्कूल
के विस्तार हेतु 10,000 दस हजार ईटे भी दान की गई।"
        images1={w91}
        images2={w92}
      />
      <WorkSection
        para="10. दिनांक 11 सितम्बर 2016 - अनुभव गहलोत मेमोरियल ट्रस्ट द्वारा मिलकपुर गांव
के फ्री सिलाई केन्द्र के प्रशिक्षणार्थियों को सर्टिफिकेट विपरित किये गये एवं प्रथम,
द्वितीय और तृतीय को कैश अवार्ड से सम्मानित किया गया। जिसका सम्पूर्ण
आयोजन श्री एस.एस. संधू द्वारा किया गया।"
      />
      <WorkSection
        para="11. दिनांक 15 मई 2016 - एक वर्ष उपरान्त मिलकपुर गांव के फ्री सिलाई केन्द्र में
प्रशिक्षाणार्थी महिलाओं के अगले ग्रुप को सर्टिफिकेट विपरित किये गये एवं प्रथम
द्वितीय और तृतीय को कैश अवार्ड से सम्मानित किया गया।"
      />
      <WorkSection
        para="12. दिनांक 13 मार्च 2016 - अनुभव गहलोत मेमोरियल ट्रस्ट द्वारा श्रीमती सुदेश
गहलोत ने अपने निवास साउथ सिटी - 1 में मुफ्त नेत्र कैम्प का आयोजन किया।
जिसमें लगभग 100 व्यक्तियांे ने कैम्प का लाभ उठाया।"
        images1={w121}
        images2={w122}
      />
      <WorkSection
        para="13. दिनांक 21 अगस्त, 2016 - अनुभव गहलोत मेमोरियल ट्रस्ट के सौजन्य से गांव
ढीगल, जिला सोनीपत में चल रहे मुफ्त सिलाई सेन्टर में छः महीने के कोर्स की
समाप्ति पर सभी महिलाओं को सर्टिफिकेट विपरित किए गए जिसमें भव्य हवन का
भी आयोजन किया गया तथा प्रथम, द्वितीय एवं तृतीय स्थान पर प्रशिक्षणार्थियों को
कैश अवार्ड दिये गये। इस आयोजन को सफल बनाने में श्री ओ.पी. शर्मा जी का
विशेष योगदान रहा।"
        images1={w131}
        images2={w132}
      />
      <WorkSection
        para="14. दिनांक 25 जुलाई 2016 - अनुभव गहलोत मेमोरियल ट्रस्ट द्वारा ग्राम न्यू नसोदी,
जिला सोनीपत में फ्री मेडिकल कैम्प का आयोजन किया गया जिसके अंतर्गत नेत्र
विशेषज्ञ, हड्डी विशेषज्ञ, स्त्री रोग विशेषज्ञ, चर्म रोग विशेषज्ञ एवं सामान्य
चिकित्सको की सेवाओं का लगभग 600 व्यक्तियों ने लाभ लिया। इसी कैम्प में
ग्राम के 6 बुर्जुगों का सफल मोतिया बिन्द का ऑपरेशन ट्रस्ट के खर्चे पर करवाया
गया। इस कार्यक्रम को सफल बनाने मे श्रीमती सीमा धीमान एवं श्री सतीश कुमार
ने भरपूर योगदान दिया।"
        images1={w141}
        images2={w142}
      />
      <WorkSection
        para="15. नवम्बर 2016 - अनुभव गहलोत मेमोरियल ट्रस्ट द्वारा कैप्टन चन्दर लाल स्पेशल
मिडिल अन्ध विद्यालय गुड़गांव के सभी विद्यार्थियों को 125 ट्रैक सूट वितरित किये
गये।"
      />
      <WorkSection
        para="16. 15 जनवरी 2017 - अनुभव गहलोत मेमोरियल ट्रस्ट की ओर से ग्राम मेहम, जिला
रोहतक में फ्री मेडिकल कैम्प का आयोजन किया गया जिसमें लगभग 600 लोगों ने
शिरक्त की और महिला रोग विशेषज्ञ नेा रोग विशेषज्ञ, जनरल चिकित्सक और
एक्यूप्रेशर चिकित्सकों की सेवाओं का लाभ उठाया। इस मेडिकल कैम्प को सफल
बनाने में ए.जी.एम.टी के माननीय सदस्य श्री अजमेर सिंह जी का भरपूर योगदान
रहा।"
        images1={w161}
        images2={w162}
      />
      <WorkSection
        para="17. 18 फरवरी 2017 - अनुभव गहलोत मेमोरियल ट्रस्ट की तरफ से दिल्ली के
मेडिकल अस्पताल के सामने गरीब लोगों को 600 खाने की प्लेट्स और शुद्ध पानी
की बोतलें विपरित की गई।"
        images1={w171}
        images2={w172}
      />
      <WorkSection
        para="18. फरवरी 2017 - अनुभव गहलोत मेमोरियल ट्रस्ट द्वारा ग्राम रिढाउ जिला सोनीपत
के सरकारी विद्यालय में बच्चों के लिए झूले लगवाये गए जिसको सम्पन्न सरवाने में
ट्रस्ट के माननीय सदस्य श्री संदीप दहिया का पूर्ण योगदान रहा।"
      />
      <WorkSection
        para="19. 24 अप्रैल 2017 - अनुभव गहलोत मेमोरियल ट्रस्ट प्रतिवर्ष 24 अप्रैल को
स्कॉलरशिप प्रोग्राम का आयोजन करता है जिसके अंतर्गत राजकीय माध्यमिक
विद्यालय रिढाउ राजकीय माध्यमिक कन्या विद्यालय, फरमाना राजकीय माध्यमिक
बाल विधालय फरमाना, सीनियर सैकेण्डरी बाल विद्यालय फरमाना ग्राम के होनहार
बालकों एवं बालिका विद्यार्थियों को सम्मानित करते हुए पारितोषिक तथा
सेर्टिफिकेट दिए जाते है। वर्ष 2017 में विद्यार्थियों, बेस्ट टीचर, प्राधानाचार्य, हैड
मास्टर एवं बेस्ट सहायक को निम्नलिखित पारितोषिक वितरीत किये गये।
(1) प्रथम स्थान प्राप्त विद्यार्थी - 50 ग्राम चाँदी में गोल्ड प्लेटिड स्मृति चिन्ह भेंट।
(2) द्वितीय स्थान प्राप्त विद्यार्थी - 50 ग्राम चाँदी का स्मृति चिन्ह भेंट।
(3) तृतीय स्थान प्राप्त विद्यार्थी - 40 ग्राम चाँदी का स्मृति चिन्ह भंेट।
(4) बेस्ट अध्यापक - चाँद का स्मृति चिन्ह भेंट।
(5) हैड मास्टर - चाँदी का गोल्ड प्लेटेड स्मृति चिन्ह भेंट।
(6) प्रिंसिपल - चाँदी का गोल्ड प्लेटेड स्मृति चिन्ह भेंट।
(7) सहायक - चाँदी का स्मृति चिन्ह भेंट।
इसके अतिरिक्त सभी विद्यार्थियों में 1,000 मिठाई के डिब्बे वितरित किये गये तथा
सम्मानित विद्यार्थियों को अलग से मिठाई के डिब्बे वितरित किये गये।"
        images1={w191}
        images2={w192}
      />
      <WorkSection
        para="20. 18 जून 2017 - अनुभव गहलोत मेडिकल ट्रस्ट द्वारा गुड़गाँव के सेक्टर 31 में
एच.एस.आ.ई.आई.डी.सी. हाउसिंग कॉम्पलैक्स के प्रांगन में फ्री मेडिकल कैम्प का
आयोजन किया गया। जिसमें लगभग 200 लोगों ने फ्री खून की जाँच, नेत्रों की
जाँच एवं दांतों की जाँच का लाभ उठाया। इस प्रोग्राम को सफल बनाने में श्रीमती
सुदेश गहलोत का पूर्ण सहयोग रहा।"
        images1={w201}
        images2={w202}
      />
      <WorkSection
        para="21. नवम्बर 2017 - अनुभव गहलोत मेमोरियल ट्रस्ट की ओरसे ग्राम बसोदी जिला
सोनीपत में फ्री मेडिकल कैम्प आयोजित किया गया जिसमें नेत्र विशेषज्ञों ने
लगभग 600 लोगों का सफल उपचार एवं जाँच की गई। जिसमंे 12 बुर्जुगों के
नेत्रों का मोतिया बिंद का सफल ऑपरेश ट्रस्ट के द्वारा करवाया गया। सभी मरीजों
का ऑपरेश नोएडा अस्पताल से करवाया गया जिसमे ट्रस्ट के माननीय सदस्य श्री
सतीश कुमार एवं श्रीमती सीमा का सम्पूर्ण सहयोग रहा।"
        images1={w211}
        images2={w212}
      />
      <WorkSection
        para="22. 19 जुलाई, 2017 - ग्राम ढीगल में ट्रस्ट द्वारा चलाये जा रहे फ्री महिला सिलाई
केन्द्र में प्रशिक्षण सम्पूर्ण कर चुकी सभी महिलाओं को सर्टिफिकेट वितरित किये
गये। इस केन्द्र में प्रति छः महीने मंे कोर्स की समाप्ति पर सर्टिफिकेट वितरित
किये जाते हैं तथा प्रथम, द्वितीय एवं तृतीय स्थान प्राप्त महिलाओं को कैश अवार्ड
भी दिये जाते है। इस प्रोग्राम को सफल बनाने में ट्रस्ट के माननीय सदस्य श्री ओपी.
शर्मा का सम्पूर्ण योगदान रहा।"
        images1={w221}
        images2={w222}
      />

      <div className="members">
        <h1>Our Members</h1>
        <div className="team-grid">
          {jsonData.map((member) => (
            <MemberCard name={member.NAME} position={member.DESIGNATION} />
          ))}
        </div>
        <div className="member-grid">
          {dataMember.map((member) => (
            <ActiveCard name={member.NAME} position={member.DESIGNATION} />
          ))}
        </div>
      </div>
    </div>
  );
}

export default Home;
